/**
 * Created by junyoung on 2017. 1. 8..
 */
/**
 * Created by Junyoung on 2016. 12. 2..
 */

function randomAdj(){
    const adjs = [
        "신기한","배고픈","과제많은","워커홀릭","커피매니아", "게으른", "지친", "행복한", "할거없는", "패셔니스타", "조용한", "외로운", "돈많은", "앱등이", "다귀찮은",
        "삶을포기한", "테러리스트", "심심한", "공익", "군대갈", "은둔형", "사실연대생", "굶주린", "익명의", "키 큰", "키작은", "화가많은", "웃는", "옆집사는", "취한",
        "앞집사는", "뒷집사는", "속삭이는", "수줍은", "밑장빼는", "깔끔한", "막말하는", "괴랄한", "드러누운", "과제미룬", "노력왕", "과제왕", "백발백중", "A+", "매력터지는",
        "사차원의", "우주최강", "분발하는", "읍읍읍", "나리나리", "안타까운", "멀쩡한", "유머러스한", "의외의", "어질어질", "고무고무", "따끈따끈한", "마음대로인","1등예정자",
        "헷갈리는", "일해라", "흥칫뿡", "진정한", "최고의", "캐미폭발", "지적인", "속닥중독", "힙스터", "꿈많은", "새로운", "제가바로", "불똥떨어진", "아직도", "오늘의",
        "예비", "사실", "레알", "너무햅", "진지한", "사뭇", "너와나의"
    ];

    return adjs[ Math.floor(Math.random()*adjs.length) ]
}

function randomNoun() {
    const nouns = [
        "개발자","디자이너","공대생","술꾼","생대생", "프리라이더","하루살이","너도밤나무","잠만보", "지식인", "밥버거", "파워댓글러", "대학생", "형님", "물음표",
        "연결고리","영통커", "전문가", "외계인", "배우신분", "인문학도","신지식인", "파워블로거","지식인", "댓글봇", "응원단장", "잠꾸러기",
        "참치", "파전제조기", "감자", "외대생", "체대생", "잡스", "쿠키", "영웅", "여자친구", "남자친구", "국민", "대통령", "예스맨",
        "귤", "중독자","교수님", "고구마", "뉴비", "개나리", "제주도민", "뉴요커", "김읍읍", "회장", "과탑", "수석", "학고", "만수르",
        "만찐두빵", "사자", "취준생", "첩자", "대장님", "아싸", "심심이", "복학생", "커플", "솔로", "잉여킹", "통학커", "출튀왕", "자취생",
        "혼밥왕"

    ];

    return nouns[ Math.floor(Math.random()*nouns.length) ]
}

exports.getRandom = function(){
    return randomAdj() + " " + randomNoun()
};